<?php

$text = ' Закінчив курс php з працевлаштуванням.
Від академії отримав те що хотів — необхідний рівень знань для роботи 
на позиції junior php developer. Адміністрація компанії завжди готова йти 
назустріч. Через особисті справи був вимушений перервати навчання на місяць, 
після цього повернувся до навчання без будь яких втрат у плані лекційного 
матеріалу(продовжив навчання з іншою групою) або грошей.
По закінченню 4-ох місячного курсу мені запропонували пройти в академії 3 
місячне стажування, і навіть після його закінчення академія допомагала мені 
з працевлаштуанням test-.
Серед викладачів, а за час навчання я встиг познайомитися з декількома 
через заміни, хочу відмітити Віктора Нікіташа. Тому якщо ви хочете йти на 
курси і у вас є можливість попасти до Віктора в групу — дуже раджу) І ще 
одна порада яку хочу дати майбутнім студентам — якщо ви не будете вчитися 
самі то академія за вас це не зробить і ніякого працевлаштування ви не 
отримаєте. PHP (як і будь яку іншу мову) можна вивчити і самостійно, 
але знаю по собі що на це в мене б пішло більше чим 4 місяці, тому в цьому 
плані я зекономив час коли пішов в академію) Для мене головне результат, а 
результат такий, що я почав працювати над реальним проектами ще навіть до 
здачі диплому, тому я дуже задоволений щоб обрав навчання саме в PHP-Academy!';

$text = preg_replace('/(ph)(p)/i', '[$1]{$2}', $text);
var_dump($text);

preg_match_all('/php/i', $text, $matches);
var_dump($matches);


